// // while цикл
// int x = 5;
// while (x > 0)
// {
//     x--; //x -= 1  x = x - 1

   
//    if (x == 3 || x == 1)
//       continue; //breake
//    Console.WriteLine($"{x} 111");
// }

// Console.WriteLine($"OK");



// for (int i = 0; i < 10; i++)
// {
//     Console.WriteLine($"{i} OK");
// }

//------------------------------------------------------------------------------------------------------------


// double x = 7.45;
// double y = 3.875;
// double result = Math.Pow(x, y);

// Console.WriteLine ($"{result}");



//------------------------------------------------------------------------------------------------------------

// Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.

// Например:
// 78 -> 8
// 12-> 2
// 85 -> 8

//  int x = new Random().Next(10, 100);

//  int x1 = x / 10;
//  int x2 = x % 10;
// Console.WriteLine($"{x}");
// if (x1 > x2)
//    Console.WriteLine($"{x1}");
// else
//    Console.WriteLine($"{x2}");

//------------------------------------------------------------------------------------------------------------


// 11) Напишите программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа.

// 456 -> 46
// 782 -> 72
// 918 -> 98


// int x = new Random().Next(100, 1000);
// int x1 = x / 100;
// int x2 = x % 10;

// Console.WriteLine($"{x1}{x2}");
// Console.WriteLine($"{x}");


 //------------------------------------------------------------------------------------------------------------



// 12) Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому. Если число 2 не кратно числу 1, то программа выводит остаток от деления.

// 34, 5 -> не кратно, остаток 4 
// 16, 4 -> кратно

// Console.WriteLine("Введите первое число");
// int x1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число");
// int y1 = Convert.ToInt32(Console.ReadLine());

// if (x1 % y1 == 0)
// {
//     Console.WriteLine("Кратное число");

// }
// else
// {
//     Console.WriteLine($"{x1 % y1} Не Кратное число");

// }


//------------------------------------------------------------------------------------------------------------



// Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 
// 7 и 23.

// 14 -> нет 
// 46 -> нет 
// 161 -> да


// Console.WriteLine("Введите число");
// int x = Convert.ToInt32(Console.ReadLine());


// if ((x % 7 == 0) & (x % 23 == 0))
// {
//     Console.WriteLine("Кратное число");

// }
// else
// {
//     Console.WriteLine($"Не Кратное число");

// }


//------------------------------------------------------------------------------------------------------------



// 16) Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.

// 5, 25  ->  да
// -4, 16  ->  да
// 25, 5  ->  да
// 8,9  ->  нет

// Console.WriteLine("Введите Первое число");
// int x = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите Второе число");
// int y = Convert.ToInt32(Console.ReadLine());


// if ((x * x == y) || (y * y == x))
// {
//     Console.WriteLine("ДА");

// }
// else
// {
//     Console.WriteLine($"Нет");

// }
